import React from "react";
import ServiceCard from "./service-card";

const servicesData = [
  {
    title: "24/7 გადაუდებელი ევაკუაცია",
    description:
      "ჩვენ ყოველთვის მზად ვართ დაგეხმაროთ, დღე და ღამე. ჩვენი მრგვალი საათის სერვისი ნიშნავს, რომ შეგიძლიათ ჩვენი იმედი გქონდეთ, როცა დაგჭირდებათ დახმარება.",
    icon: (
      <svg
        fill="currentColor"
        width="800px"
        height="800px"
        viewBox="0 0 50 50"
        xmlns="http://www.w3.org/2000/svg"
        xmlnsXlink="http://www.w3.org/1999/xlink"
      >
        <path d="M4.8125 4C4.609375 4.035156 4.425781 4.136719 4.28125 4.28125L3.28125 5.28125C2.917969 5.644531 2.890625 6.226563 3.21875 6.625L4 7.5625L4 19C4 19.550781 4.449219 20 5 20C5.566406 20 6 20.433594 6 21C6 21.566406 5.566406 22 5 22C4.433594 22 4 21.566406 4 21L2 21C2 22.644531 3.355469 24 5 24C6.644531 24 8 22.644531 8 21C8 19.742188 7.109375 18.847656 6 18.40625L6 10L17 23.375L17 28L0 28L0 35C0 36.644531 1.355469 38 3 38L7.09375 38C7.570313 40.835938 10.035156 43 13 43C15.964844 43 18.429688 40.835938 18.90625 38L33.09375 38C33.570313 40.835938 36.035156 43 39 43C41.964844 43 44.429688 40.835938 44.90625 38L47 38C48.644531 38 50 36.644531 50 35L50 25.375C50 23.085938 48.40625 21.0625 48.40625 21.0625L48.375 21.0625L44.25 15.5625L44.25 15.53125L44.21875 15.5C43.296875 14.386719 41.914063 13 40 13L32 13C30.355469 13 29 14.355469 29 16L29 28L27 28L27 23C27 22.710938 26.875 22.4375 26.65625 22.25L5.65625 4.25C5.453125 4.066406 5.179688 3.976563 4.90625 4C4.875 4 4.84375 4 4.8125 4 Z M 6.875 7.9375L25 23.46875L25 28L19 28L19 23C19 22.773438 18.921875 22.550781 18.78125 22.375 Z M 32 15L40 15C40.785156 15 41.894531 15.84375 42.65625 16.75C42.664063 16.761719 42.679688 16.769531 42.6875 16.78125L42.84375 17L38 17C36.40625 17 35 18.289063 35 20L35 24C35 24.832031 35.375 25.5625 35.90625 26.09375C36.4375 26.625 37.167969 27 38 27L48 27L48 35C48 35.554688 47.554688 36 47 36L44.90625 36C44.429688 33.164063 41.964844 31 39 31C36.035156 31 33.570313 33.164063 33.09375 36L31 36L31 16C31 15.445313 31.445313 15 32 15 Z M 38 19L44.34375 19L46.78125 22.25C46.78125 22.25 47.6875 23.800781 47.875 25L38 25C37.832031 25 37.5625 24.875 37.34375 24.65625C37.125 24.4375 37 24.167969 37 24L37 20C37 19.496094 37.59375 19 38 19 Z M 2 30L29 30L29 36L18.90625 36C18.429688 33.164063 15.964844 31 13 31C10.035156 31 7.570313 33.164063 7.09375 36L3 36C2.449219 36 2 35.550781 2 35 Z M 13 33C15.222656 33 17 34.777344 17 37C17 39.222656 15.222656 41 13 41C10.777344 41 9 39.222656 9 37C9 34.777344 10.777344 33 13 33 Z M 39 33C41.222656 33 43 34.777344 43 37C43 39.222656 41.222656 41 39 41C36.777344 41 35 39.222656 35 37C35 34.777344 36.777344 33 39 33Z" />
      </svg>
    ),
  },
  {
    title: "უბედური შემთხვევის აღდგენა",
    description:
      "უბედური შემთხვევის შემთხვევაში, ჩვენი გუნდი სწრაფად რეაგირებს შემთხვევის ადგილზე, რაც უზრუნველყოფს თქვენი მანქანის უსაფრთხო მოხსნას.",
    icon: (
      <svg
        viewBox="0 0 24 24"
        fill="currentColor"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
        <g
          id="SVGRepo_tracerCarrier"
          strokeLinecap="round"
          strokeLinejoin="round"
          stroke="currentColor"
          strokeWidth="0.096"
        ></g>
        <g id="SVGRepo_iconCarrier">
          <path
            d="M19 15.9999L4 15.9999M4 15.9999L7 12.9999M4 15.9999L7.00006 19M5 7.99994L20 7.99994M20 7.99994L17.0001 5M20 7.99994L17.0001 10.9999"
            stroke="currentColor"
            strokeWidth="1.2"
            strokeLinecap="round"
            strokeLinejoin="round"
          ></path>
        </g>
      </svg>
    ),
  },
  {
    title: "დახმარება ავარიაში",
    description:
      "მიუხედავად იმისა, გზის პირას ხართ ჩარჩენილი თუ თქვენს გზაზე, ჩვენ სასწრაფოდ და ეფექტურად მოვალთ თქვენს გადასარჩენად.",
    icon: (
      <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
        <g
          id="SVGRepo_tracerCarrier"
          strokeLinecap="round"
          strokeLinejoin="round"
        ></g>
        <g id="SVGRepo_iconCarrier">
          <path
            d="M20 18V12.3246C20 12.1096 19.9653 11.896 19.8974 11.6921L18.4558 7.36754C18.1836 6.55086 17.4193 6 16.5585 6H7.44152C6.58066 6 5.81638 6.55086 5.54415 7.36754L4.10263 11.6921C4.03466 11.896 4 12.1096 4 12.3246V18M20 18H4M20 18V19.5C20 19.7761 19.7761 20 19.5 20C19.2239 20 19 19.7761 19 19.5V18M4 18V19.5C4 19.7761 4.22386 20 4.5 20C4.77614 20 5 19.7761 5 19.5V18M4.33333 11H19.6667M8 14V15M16 14V15"
            stroke="currentColor"
            strokeWidth="1.2"
            strokeLinecap="round"
            strokeLinejoin="round"
          ></path>
        </g>
      </svg>
    ),
  },
  {
    title: "საქალაქთაშორისო ტრანსპორტი",
    description:
      " გჭირდებათ თქვენი მანქანის გადაადგილება მთელი ქვეყნის მასშტაბით? ჩვენ დაგიფარავთ ჩვენი საქალაქთაშორისო ტრანსპორტის მომსახურებით.",
    icon: (
      <svg
        viewBox="-3.2 -3.2 38.40 38.40"
        xmlns="http://www.w3.org/2000/svg"
        fill="currentColor"
        stroke="currentColor"
        strokeWidth="0.00032"
      >
        <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
        <g
          id="SVGRepo_tracerCarrier"
          strokeLinecap="round"
          strokeLinejoin="round"
        ></g>
        <g id="SVGRepo_iconCarrier">
          {" "}
          <g fill="none" fillRule="evenodd">
            {" "}
            <path d="m0 0h32v32h-32z"></path>{" "}
            <path
              d="m28 5c2.1421954 0 3.8910789 1.68396847 3.9951047 3.80035966l.0048953.19964034v14c0 2.1421954-1.6839685 3.8910789-3.8003597 3.9951047l-.1996403.0048953-.1262135.0007613c-.4443075 1.7248409-2.0102213 2.9992387-3.8737865 2.9992387s-3.429479-1.2743978-3.8737865-2.9992387h-8.252427c-.4443075 1.7248409-2.01022125 2.9992387-3.8737865 2.9992387s-3.42947895-1.2743978-3.87378648-2.9992387l-.12621352-.0007613c-2.14219539 0-3.89107888-1.6839685-3.99510469-3.8003597l-.00489531-.1996403v-14c0-2.14219539 1.68396847-3.89107888 3.80035966-3.99510469l.19964034-.00489531zm-20 19c-1.1045695 0-2 .8954305-2 2s.8954305 2 2 2 2-.8954305 2-2-.8954305-2-2-2zm16 0c-1.1045695 0-2 .8954305-2 2s.8954305 2 2 2 2-.8954305 2-2-.8954305-2-2-2zm4-17h-24c-1.0543618 0-1.91816512.81587779-1.99451426 1.85073766l-.00548574.14926234v14c0 1.0543618.81587779 1.9181651 1.85073766 1.9945143l.14926234.0054857.12595483.0002435c.44395811-1.7253508 2.01011806-3.0002435 3.87404517-3.0002435s3.4300871 1.2748927 3.8740452 3.0002435h8.2519096c.4439581-1.7253508 2.0101181-3.0002435 3.8740452-3.0002435s3.4300871 1.2748927 3.8740452 3.0002435l.1259548-.0002435c1.0543618 0 1.9181651-.8158778 1.9945143-1.8507377l.0054857-.1492623v-14c0-1.0543618-.8158778-1.91816512-1.8507377-1.99451426zm-3 2c1.6568542 0 3 1.3431458 3 3v4c0 1.6568542-1.3431458 3-3 3h-18c-1.65685425 0-3-1.3431458-3-3v-4c0-1.6568542 1.34314575-3 3-3zm-14 2h-4c-.55228475 0-1 .4477153-1 1v4c0 .5522847.44771525 1 1 1h4zm8 0h-6v6h6zm6 0h-4v6h4c.5128358 0 .9355072-.3860402.9932723-.8833789l.0067277-.1166211v-4c0-.5522847-.4477153-1-1-1z"
              fill="currentColor"
              fillRule="nonzero"
            ></path>
          </g>
        </g>
      </svg>
    ),
  },
];

export default function services() {
  return (
    <section className="pt-16 pb-8 h-auto">
      <h1 className="text-3xl text-center">სერვისები</h1>

      <div className="max-w-[85rem] px-4 py-10 sm:px-6 lg:px-8 lg:py-14 mx-auto">
        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-10">
          {servicesData.map((item, idx) => (
            <ServiceCard
              key={idx}
              id={idx}
              index={idx}
              title={item.title}
              icon={item.icon}
              description={item.description}
            />
          ))}
        </div>
      </div>
    </section>
  );
}
